=begin
アルファベット探し (paizaランク C 相当)
問題にチャレンジして、ユーザー同士で解答を教え合ったり、コードを公開してみよう！

シェア用URL:
https://paiza.jp/works/mondai/prob60/alphabets_large_or_small_9
問題文のURLをコピーする
Img 04 03 下記の問題をプログラミングしてみよう！
1行目の英大文字 X から、2行目の英大文字 Y の範囲に3行目のアルファベット C が含まれていれば"true", そうでなければ"false"と出力してください。
X が Y よりもアルファベット順で後ろになる場合(X = 'G', Y = 'F'のときなど)も"false"と出力してください。

▼　下記解答欄にコードを記入してみよう

入力される値
入力は以下のフォーマットで与えられます。

X
Y
C

入力値最終行の末尾に改行が１つ入ります。


入力値最終行の末尾に改行が１つ入ります。
文字列は標準入力から渡されます。 標準入力からの値取得方法はこちらをご確認ください
期待する出力
出力は、 "true" または "false" のどちらかです。

条件
・X, Y, Cはそれぞれ英大文字です。

入力例1
A
D
C

出力例1
true

入力例2
D
D
D

出力例2
true

入力例3
A
D
Z

出力例3
false
=end